import { FC } from "react";

export const GuraDesc: FC = () => (
  <div>
    <p>
      がうる・ぐらちゃんと古代日本文明を組み合わせて色々描いたり動かしたりしてみました。
      配信切り抜きをゲームに組み入れるという変わった形式でコンテンツを提供いたします。
    </p>
  </div>
);

export const BookDesc: FC = () => (
  <div>
    <p>
      交換留学を満喫している中、掛け替えのない日常を残したいという思いで作りました。
      AIと何気ない会話をし、日常を音楽の形式で記録するコンテンツになっております。
    </p>
  </div>
);

export const CameraDesc: FC = () => (
  <div>
    <p>
      今日、ほとんどの人間が常にカメラを携帯しており、いつでも手軽に記録できる。
      そこには美しさや面白さ、或いはわずらわしさがあるが、何を切り取るかを決めているのは、まぎれもなく人間である。
    </p>
  </div>
);

export const GuitarDesc: FC = () => (
  <div>
    <p>
      コントローラーはギターです。
      さぁみなさんギターを好きなように好きな音色で鳴らしてみましょう。
      エフェクターによって音の表情も君の行動も変わります。
    </p>
  </div>
);

export const HourGlassDesc: FC = () => (
  <div>
    <p>
      人生とは変化の連続。
      その変化は、拒むべきものではなく、成長へとつながる大切な一歩です。
      忘れかけていた人生の変化や過程を、ギャルゲーを通じてもう一度体験してみませんか？
    </p>
  </div>
);

export const MirrorDesc: FC = () => (
  <div>
    <p>
      カーブミラーに映る自分の姿と、移ろい続ける風景。
      変わりゆく世界の中で、変わらない自分とは何か。
      このミラーが映し出すものはただの姿か、それとも別の何かか。
      固定された自分と変化する背景の対比は、私たちの「自己像」が環境や視点によってどれほど影響を受けているかを示唆する。
    </p>
  </div>
);

export const MobiusDesc: FC = () => (
  <div>
    <p>
      筑波大学情報メディア創成学類3年の唯見月日は、この日の朝、少し早めに目を覚ました。
      学園祭を心待ちにしていた彼は、いつもより早く家を出て、研究プロジェクトの仲間である物理学類3年の四季メグリと偶然出会う。
      その日の夜、二人は屋上で一緒に花火を眺め、唯見は学園祭を存分に満喫した。
      しかし、その心には何か大切なものを忘れているような、漠然とした感覚が残る。
      忘れてしまったことは、一体何だったのだろうか…
      【本作品は、複数回のプレイが必要となる場合がございます】
    </p>
  </div>
);

export const PhoneDesc: FC = () => (
  <div>
    <p>
      私たちはAIとの対話を通じて多くの情報や利益を得ている。
      しかし、AIの有益性を意識的に捉える機会は少ない。
      本作品ではAIとの不毛な会話を通じて、彼らの有益性を再認識する機会を提供する。
    </p>
  </div>
);
